scripts/pilotplant_species_copy/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/globalVars"

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species
(
    water
    CO2
    H2
);

defaultSpecie water;

"(mixture|water)"
{
    specie
    {
        molWeight   18.0153;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf          -1.5879e+07; // I think it is not used
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrMixLiq;
    }
}

CO2
{
    specie
    {
        molWeight   44.00995;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrCO2;
    }
}

CO
{
    specie
    {
        molWeight   28.0106;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;//-9402451;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrCO;
    }
}

H2
{
    specie
    {
        molWeight   2.01594;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;//-9402451;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrH2;
    }
}

CH4
{
    specie
    {
        molWeight   16.04;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;//-9402451;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrCH4;
    }
}



// ************************************************************************* //
